1s/ERP/Conf/Documents/Лико_СчетНаОплатуКлиенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_СчетНаОплатуКлиенту</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастичнаяОплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>Поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияЗаявокНаТранспортировку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияЗаявокНаТранспортировку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ШаблоныЗаявокНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ШаблоныЗаявокНаОтгрузку</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыОтгрузкиГотовойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкаВРублях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеальныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_СчетНаОплатуКлиенту/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Менеджер",  Менеджер, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Менеджер));
	
	ОтборыСписковКлиентСервер.СкопироватьСписокВыбораОтбораПоМенеджеру(
		Элементы.Менеджер.СписокВыбора,
		ОбщегоНазначенияУТ.ПолучитьСписокПользователейСПравомДобавления(Метаданные.Документы.СчетНаОплатуКлиенту));
		
	//Элементы.Аннулировать.Видимость = ПравоДоступа("Изменение", Метаданные.Документы.СчетНаОплатуКлиенту);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаГлобальныеКоманды);
	// Конец ИнтеграцияС1СДокументооборотом

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПриСозданииНаСервере = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаСписка();
	ПараметрыПриСозданииНаСервере.Форма = ЭтотОбъект;
	ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд = Элементы.ПодменюЭДО;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаСписка(ПараметрыПриСозданииНаСервере);
	// Конец подсистема "ОбменСКонтрагентами".
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияКлиентПереопределяемый.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыОповещенияЭДО = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаСписка();
	ПараметрыОповещенияЭДО.Форма = ЭтотОбъект;
	ПараметрыОповещенияЭДО.ИмяДинамическогоСписка = "Список";
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаСписка(ИмяСобытия, Параметр, Источник, ПараметрыОповещенияЭДО);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Состояние = Настройки.Получить("Состояние");
	Менеджер  = Настройки.Получить("Менеджер");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", Состояние, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Состояние));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Менеджер",  Менеджер, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Менеджер));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Менеджер",  Менеджер, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Менеджер));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Аннулировать(Команда)
	
	Если Не ОбщегоНазначенияУТКлиент.ПроверитьНаличиеВыделенныхВСпискеСтрок(Элементы.Список) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='Выделенные в списке счетов на оплату будут аннулированы. Продолжить?'");
	Ответ = Неопределено;

	ПоказатьВопрос(Новый ОписаниеОповещения("АннулироватьЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    КоличествоОбработанных = УстановитьПризнакАннулироваСервер(Элементы.Список.ВыделенныеСтроки);
    
    Если КоличествоОбработанных > 0 Тогда
        
        Элементы.Список.Обновить();
        
        ТекстСообщения = НСтр("ru='%КоличествоОбработанных% из %КоличествоВсего% выделенных в списке счетов на оплату аннулированы.'");
        ТекстСообщения = СтрЗаменить(ТекстСообщения,"%КоличествоОбработанных%", КоличествоОбработанных);
        ТекстСообщения = СтрЗаменить(ТекстСообщения,"%КоличествоВсего%",        Элементы.Список.ВыделенныеСтроки.Количество());
        ПоказатьОповещениеПользователя(НСтр("ru='Счета на оплату аннулированы'"),, ТекстСообщения, БиблиотекаКартинок.Информация32);
        
    Иначе
        
        ТекстСообщения = НСтр("ru='Не аннулирован ни один счет на оплату.'");
        ПоказатьОповещениеПользователя(НСтр("ru='Счета на оплату не аннулированы'"),, ТекстСообщения, БиблиотекаКартинок.Информация32);
        
    КонецЕсли;

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры
//Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = НСтр("ru = 'Аннулирован'");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);
	

	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.СписокДата.Имя);


КонецПроцедуры

#Область ПриИзмененииРеквизитов

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", Состояние, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Состояние));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	// --> Начало Лико Ефимов ЕВВ 15.12.2017
	Возврат;
	// <-- Конец Лико Ефимов ЕВВ 15.12.2017
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.СчетНаОплатуКлиенту.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	Если МассивСсылок.Количество() > 0 Тогда
		Элементы.Список.ТекущаяСтрока = МассивСсылок[0];
		ПоказатьЗначение(Неопределено, МассивСсылок[0]);
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервереБезКонтекста
Функция УстановитьПризнакАннулироваСервер (Знач СчетаНаОплату)
	
	Возврат Документы.СчетНаОплатуКлиенту.УстановитьПризнакАннулирован(СчетаНаОплату);
	
КонецФункции

&НаКлиенте
Процедура СоздатьЗаявкуНаОтгрузку(Команда)
	текстр = Элементы.Список.ТекущиеДанные;	
	Если текстр<>Неопределено Тогда 
		Партнер = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(текстр.Ссылка, "Партнер");	
		//Если есть шаблоны отгрузки, выбираем шаблон, если нет, показываем список заявок этого партнера для копирования
		Если ЕстьШаблоныОтгрузок(Партнер) Тогда 
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораШаблонаОтгрузки", ЭтотОбъект);
			Отбор = Новый Структура("Партнер",Партнер);
			ПараметрыФормы = Новый Структура("Отбор",Отбор);
			ОткрытьФорму("Справочник.Лико_ШаблоныЗаявокНаОтгрузку.ФормаВыбора",ПараметрыФормы,ЭтаФорма,Новый УникальныйИдентификатор,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		Иначе   
			Контрагент = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(текстр.Ссылка, "Контрагент");
			ОрганизацияПродавец = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(текстр.Ссылка, "Организация");  
			Отбор = Новый Структура("Контрагент",Контрагент);
			Отбор.Вставить("ОрганизацияПродавец", ОрганизацияПродавец);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЗаявкиНаОтгрузку", ЭтотОбъект);
			ПараметрыФормы = Новый Структура("Отбор",Отбор);
			ОткрытьФорму("Документ.Лико_ЗаявкаНаОтгрузку.ФормаВыбора",ПараметрыФормы,ЭтаФорма,Новый УникальныйИдентификатор,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ЕстьШаблоныОтгрузок(Партнер)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ШаблоныЗаявокНаОтгрузку.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ШаблоныЗаявокНаОтгрузку КАК Лико_ШаблоныЗаявокНаОтгрузку
	|ГДЕ
	|	Лико_ШаблоныЗаявокНаОтгрузку.Партнер = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат  Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
КонецФункции



&НаКлиенте
Процедура ПослеВыбораШаблонаОтгрузки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда 
			Сп = Новый СписокЗначений;  
			сП.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);	
			
			ФормаЗаявки = ПолучитьФорму("Документ.Лико_ЗаявкаНаОтгрузку.Форма.ФормаДокумента");
			ДанныеФормы = ФормаЗаявки.Объект; 
			ЗаполнитьЗаявкуНаОтгрузкуНаСервере(ДанныеФормы, Результат, СП);
			КопироватьДанныеФормы(ДанныеФормы, ФормаЗаявки.Объект); // копируем наш объект в объект формы и далее открываем ее
			ФормаЗаявки.Открыть();

    			
		КонецЕсли;
   КонецЕсли;	
КонецПроцедуры  

&НаСервере
Функция ЗаполнитьЗаявкуНаОтгрузкуНаСервере(ДанныеФормы, ШаблонЗаявкиНаОтгрузку,СписокЗаказов)   
		
	МетаданныеИсточник = Метаданные.Справочники.Лико_ШаблоныЗаявокНаОтгрузку;
	МетаданныеНазначение= Метаданные.Документы.Лико_ЗаявкаНаОтгрузку; 
	ДокЗаявка = Документы.Лико_ЗаявкаНаОтгрузку.СоздатьДокумент();
    ДокЗаявка.Дата = ТекущаяДата();  
	ДокЗаявка.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан;
	ДокЗаявка.Ответственный = ШаблонЗаявкиНаОтгрузку.Менеджер;

    Для Каждого Реквизит Из МетаданныеИсточник.Реквизиты Цикл
		Имя = Реквизит.Имя;
		Если МетаданныеНазначение.Реквизиты.Найти(Имя) <> Неопределено Тогда
			ДокЗаявка[Имя] =  ШаблонЗаявкиНаОтгрузку[Имя];
		КонецЕсли;
	КонецЦикла;   
	ДокЗаявка.СозданаИзЗаказаСчета = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура КАК Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика КАК Характеристика,
	|	Лико_СчетНаОплатуКлиентуТовары.Количество КАК Количество,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена КАК Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка.Валюта КАК Валюта,
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Лико_СчетНаОплатуКлиенту.Товары КАК Лико_СчетНаОплатуКлиентуТовары
	|ГДЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка В (&СписокЗаказов)
	|	И Лико_СчетНаОплатуКлиентуТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Количество КАК Количество,
	|	МАКСИМУМ(ЗаказКлиентаТовары.NКонтракта) КАК НомерПоставки,
	|	МАКСИМУМ(ЗаказКлиентаТовары.КодЭтикеткиЗаказчика) КАК КодЭтикеткиЗаказчика,
	|	ВТ.Цена КАК Цена,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ВнутреннийДиаметр) КАК Втулка,
	|	МАКСИМУМ(ЗаказКлиентаТовары.Направление) КАК Намотка,
	|	МАКСИМУМ(ЗаказКлиентаТовары.Город) КАК Город,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ЧестныйЗнак) КАК ЧестныйЗнак,
	|	ВТ.Валюта КАК ВалютаЦены,
	|	ВТ.СчетНаОплату КАК СчетНаОплату
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВТ.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|			И ВТ.Номенклатура = ЗаказКлиентаТовары.Номенклатура
	|			И ВТ.Характеристика = ЗаказКлиентаТовары.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ЗаказКлиента,
	|	ВТ.Номенклатура,
	|	ВТ.Характеристика,
	|	ВТ.Количество,
	|	ВТ.Цена,
	|	ВТ.Валюта,
	|	ВТ.СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура КАК Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика КАК Характеристика,
	|	СУММА(Лико_СчетНаОплатуКлиентуТовары.Количество) КАК Количество,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена КАК Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.Содержание КАК Содержание
	|ИЗ
	|	Документ.Лико_СчетНаОплатуКлиенту.Товары КАК Лико_СчетНаОплатуКлиентуТовары
	|ГДЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка В (&СписокЗаказов)
	|	И Лико_СчетНаОплатуКлиентуТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.Содержание"; 
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);  
	ВыборкаЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаТовары  = ВыборкаЗапросов.Получить(1).Выбрать();  
	ВыборкаУслуги = ВыборкаЗапросов.Получить(2).Выбрать(); 
	Пока ВыборкаТовары.Следующий() Цикл
		нстр = ДокЗаявка.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборкаТовары);
		нстр.Контрагент =   ШаблонЗаявкиНаОтгрузку.Контрагент;
		нстр.АдресДоставки = ШаблонЗаявкиНаОтгрузку.АдресДоставки; 
		нстр.АдресДоставкиЗначенияПолей = ШаблонЗаявкиНаОтгрузку.АдресДоставкиЗначенияПолей; 
		нстр.Грузополучатель = ШаблонЗаявкиНаОтгрузку.Грузополучатель;
		нстр.ОтгрузкаВРублях = ШаблонЗаявкиНаОтгрузку.ОтгрузкаВРублях;  
		нстр.Примечание = ШаблонЗаявкиНаОтгрузку.Примечание;  

	КонецЦикла;
	Пока ВыборкаУслуги.Следующий() Цикл
		нстр = ДокЗаявка.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборкаУслуги);
	КонецЦикла;

	
	
	
	ЗначениеВДанныеФормы(ДокЗаявка,ДанныеФормы);


КонецФункции


&НаСервере
Функция ЗаполнитьЗаявкуНаОтгрузкупоЗаявкеНаОтгрузку(ДанныеФормы, ЗаявкаНаотгрузку,СписокЗаказов)   
		
	ДокЗаявка = ЗаявкаНаотгрузку.Скопировать();
	ДокЗаявка.Дата = ТекущаяДата(); 
	ДокЗаявка.ДатаОтгрузки = '00010101';
	ДокЗаявка.СозданаИзЗаказаСчета = Истина;

	ДокЗаявка.Товары.Очистить();  
	ДокЗаявка.Услуги.Очистить();
	ДокЗаявка.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан;  
    стр = ЗаявкаНаотгрузку.Товары[0];

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура КАК Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика КАК Характеристика,
	|	Лико_СчетНаОплатуКлиентуТовары.Количество КАК Количество,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена КАК Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка.Валюта КАК Валюта,
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Лико_СчетНаОплатуКлиенту.Товары КАК Лико_СчетНаОплатуКлиентуТовары
	|ГДЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка В (&СписокЗаказов)
	|	И Лико_СчетНаОплатуКлиентуТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Количество КАК Количество,
	|	МАКСИМУМ(ЗаказКлиентаТовары.NКонтракта) КАК НомерПоставки,
	|	МАКСИМУМ(ЗаказКлиентаТовары.КодЭтикеткиЗаказчика) КАК КодЭтикеткиЗаказчика,
	|	ВТ.Цена КАК Цена,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ВнутреннийДиаметр) КАК Втулка,
	|	МАКСИМУМ(ЗаказКлиентаТовары.Направление) КАК Намотка,
	|	МАКСИМУМ(ЗаказКлиентаТовары.Город) КАК Город,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ЧестныйЗнак) КАК ЧестныйЗнак,
	|	ВТ.Валюта КАК ВалютаЦены,
	|	ВТ.СчетНаОплату КАК СчетНаОплату
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВТ.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|			И ВТ.Номенклатура = ЗаказКлиентаТовары.Номенклатура
	|			И ВТ.Характеристика = ЗаказКлиентаТовары.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ЗаказКлиента,
	|	ВТ.Номенклатура,
	|	ВТ.Характеристика,
	|	ВТ.Количество,
	|	ВТ.Цена,
	|	ВТ.Валюта,
	|	ВТ.СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура КАК Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика КАК Характеристика,
	|	СУММА(Лико_СчетНаОплатуКлиентуТовары.Количество) КАК Количество,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена КАК Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.Содержание КАК Содержание
	|ИЗ
	|	Документ.Лико_СчетНаОплатуКлиенту.Товары КАК Лико_СчетНаОплатуКлиентуТовары
	|ГДЕ
	|	Лико_СчетНаОплатуКлиентуТовары.Ссылка В (&СписокЗаказов)
	|	И Лико_СчетНаОплатуКлиентуТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_СчетНаОплатуКлиентуТовары.Номенклатура,
	|	Лико_СчетНаОплатуКлиентуТовары.Характеристика,
	|	Лико_СчетНаОплатуКлиентуТовары.Цена,
	|	Лико_СчетНаОплатуКлиентуТовары.Содержание"; 
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);  
	ВыборкаЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаТовары  = ВыборкаЗапросов.Получить(1).Выбрать();  
	ВыборкаУслуги = ВыборкаЗапросов.Получить(2).Выбрать(); 
	Пока ВыборкаТовары.Следующий() Цикл
		нстр = ДокЗаявка.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборкаТовары);
		нстр.Контрагент =   стр.Контрагент;
		нстр.АдресДоставки = стр.АдресДоставки; 
		нстр.АдресДоставкиЗначенияПолей = стр.АдресДоставкиЗначенияПолей; 
		нстр.Грузополучатель = стр.Грузополучатель;
		нстр.ОтгрузкаВРублях = стр.ОтгрузкаВРублях;  
		нстр.Примечание = стр.Примечание;  
        нстр.РеальныйДоговор = стр.РеальныйДоговор;  

	КонецЦикла;
	Пока ВыборкаУслуги.Следующий() Цикл
		нстр = ДокЗаявка.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборкаУслуги);
	КонецЦикла;
	ЗначениеВДанныеФормы(ДокЗаявка,ДанныеФормы);


КонецФункции


 &НаКлиенте
Процедура ПослеВыбораЗаявкиНаОтгрузку(Результат, ДополнительныеПараметры) Экспорт
	
    Если Результат <> Неопределено Тогда
    	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда 
    		Сп = Новый СписокЗначений;  
    		сП.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);	
    		
    		ФормаЗаявки = ПолучитьФорму("Документ.Лико_ЗаявкаНаОтгрузку.Форма.ФормаДокумента");
    		ДанныеФормы = ФормаЗаявки.Объект; 
    		ЗаполнитьЗаявкуНаОтгрузкупоЗаявкеНаОтгрузку(ДанныеФормы, Результат, СП);
    		КопироватьДанныеФормы(ДанныеФормы, ФормаЗаявки.Объект); // копируем наш объект в объект формы и далее открываем ее
    		ФормаЗаявки.Открыть();			
    	КонецЕсли;
   КонецЕсли;	
КонецПроцедуры  



#КонецОбласти

#КонецОбласти
